of40/tutorials/rheoEFoam/EKI/Ohmic/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inletNorth
    {
	type            zeroGradient;
    }
    
    inletSouth
    {
	type            zeroGradient;
    }
    
    inletWest
    {
	type            zeroGradient;
    }
      
    "(walls|frontAndBack)" 
    {
	type            slipSigmaDependent;
	elecMobility0   3e-08;
	sigma0          4;
	m               -0.3;
	value           uniform (0 0 0);      
    }

    outlet
    {
	type            zeroGradient;     
    }
}
  

// ************************************************************************* //
